### Question Set 1:  
1. Write necessary SQL statements for the following purposes:  
a. Create a database named "Himalaya" with a table "Employee" that includes EmployeeID,
Name, Gender, Age, Department, and Salary, with EmployeeID being unique.  
b. Insert details of any two employees into the table.  
c. Retrieve the Name and Department of all employees who earn more than 50,000.  
d. Update the Department of an employee to "IT" with a specific EmployeeID.  
e. Drop the "Employee" table.

In [2]:
# import module to connect to a MySQL database
import mysql.connector

conn = mysql.connector.connect(
    host = "localhost",
    user = "root",
    password = "2002"
)

# create cursor to execute sql commands
cursor = conn.cursor()

# a. Create database and table
cursor.execute("CREATE DATABASE IF NOT EXISTS Himalaya;")
cursor.execute("USE Himalaya;")
cursor.execute('''
    CREATE TABLE IF NOT EXISTS Employee(
            EmployeeID INT PRIMARY KEY,
            Name VARCHAR(50),
            Gender VARCHAR(50),
            Age INT,
            Department VARCHAR(50),
            Salary FLOAT
               );
               ''' )

# b. Insert 2 employee records
cursor.execute("""
               INSERT INTO Employee(EmployeeID, Name, Gender, Age, Department, Salary) 
               VALUES(1, 'Sita', 'Female', 30, 'Finance', 60000.00),(2, 'Ram', 'Male', 28, 'HR', 45000.00);
               """)

# c. Retrieve Name and Department of employees with salary > 50000
cursor.execute("SELECT Name, Department FROM Employee WHERE Salary > 50000;")
result = cursor.fetchall()
print("Employees with salary greater than 50K\n")
for row in result:
    print(row)

# d. Update department
cursor.execute("UPDATE Employee SET Department = 'IT' WHERE EmployeeID = 1; ")

Employees with salary greater than 50K

('Sita', 'Finance')

In [3]:
# e. Drop the employee table
cursor.execute("Drop TABLE Employee;")

# commit changes and close
conn.commit()
cursor.close()
conn.close()

### Question Set 2:  
1. Write SQL queries for the following purposes:  
a. Create a database named "Library" with a table "Books" having fields BookID, Title, 
Author, Genre, and Price. BookID should be the primary key.  
b. Add records for two books into the table.  
c. Fetch the titles and authors of all books that belong to the "Science Fiction" genre.  
d. Modify the price of a book with a specific BookID.  
e. Delete the "Books" table.

In [ ]:
# import module to connect to a MySQL database
import mysql.connector

conn = mysql.connector.connect(
    host = "localhost",
    user = "root",
    password = "2002"
)

# create cursor to execute sql commands
cursor = conn.cursor()

# a. Create database and table
cursor.execute("CREATE DATABASE IF NOT EXISTS Library;")
cursor.execute("USE Library;")
cursor.execute('''
    CREATE TABLE IF NOT EXISTS Books(
            BookID INT PRIMARY KEY,
            Title VARCHAR(50),
            Author VARCHAR(50),
            Genre VARCHAR(50),
            Price FLOAT
               );
               ''')

# b. Insert 2 records
cursor.execute("TRUNCATE TABLE Books;")
cursor.execute("""
               INSERT INTO Books(BookID, Title, Author, Genre, Price)
               VALUES
                    (1, 'Dune', 'Frank Herbert', 'Science Fiction', 500.5),
                    (2, 'Priya sufi', 'Subin Bhattarai', 'Novel', 400.25);
               """)

# c. Fetch the titles and authors of all books that belong to the "Science Fiction" genre.  
cursor.execute("SELECT Title, Author FROM Books WHERE Genre = 'Science Fiction' ;")
result = cursor.fetchall()
print("Books from science fiction genre:\n")
for row in result:
    print(row)

# d. Update the price of a book with a specific BookID.
cursor.execute("UPDATE Books SET Price = 700.45 WHERE BookID = 1; ")
conn.commit()  # to save changes

# Verify update with SELECT
print("\nRecords after update:\n")
cursor.execute("SELECT * FROM Books;")
for row in cursor.fetchall():
    print(row)

# e. Delete the Books table
cursor.execute("DROP TABLE IF EXISTS Books;")

# Commit and close connection
conn.commit()
cursor.close()
conn.close()

Books from science fiction genre:

('Dune', 'Frank Herbert')

Records after update:

(1, 'Dune', 'Frank Herbert', 'Science Fiction', 700.45)
(2, 'Priya sufi', 'Subin Bhattarai', 'Novel', 400.25)

### Question Set 3:  
1. Write SQL statements for the following:  
a. Create a database named "SchoolDB" and a table "Teacher" with fields: TeacherID, Name, 
Subject, Experience (in years), and City. TeacherID should be unique.  
b. Insert any two teacher records into the table.  
c. Retrieve all teacher names who teach "Mathematics".  
d. Change the city of a teacher to "Kathmandu" based on TeacherID.  
e. Drop the "Teacher" table.

In [5]:
# import module to connect to a MySQL database
import mysql.connector

conn = mysql.connector.connect(
    host = "localhost",
    user = "root",
    password = "2002"
)

# create cursor to execute sql commands
cursor = conn.cursor()

# a. Create database and table
cursor.execute("CREATE DATABASE IF NOT EXISTS SchoolDB;")
cursor.execute("USE SchoolDB;")
cursor.execute('''
    CREATE TABLE IF NOT EXISTS Teacher(
            TeacherID INT PRIMARY KEY,
            Name VARCHAR(100),
            Subject VARCHAR(50),
            Experience INT,      -- can use `Experience(in years)`
            City VARCHAR(100)
                    );
               ''')

# b. Insert 2 records
cursor.execute("""
               INSERT INTO Teacher(TeacherID, Name, Subject, Experience, City)
               VALUES
                    (1, 'Asha Sharma', 'Mathematics', 5, 'Pokhara'),
                    (2, 'Binod Thapa', 'Science', 7, 'Biratnagar');
               """)

# c. Retrieve teacher name who teaches mathematics  
cursor.execute("SELECT Name FROM Teacher WHERE Subject='Mathematics' ;")
result = cursor.fetchall()
print("Teacher who teaches mathematics:\n")
for row in result:
    print(row)

# d. Update the city of a teacher
cursor.execute("UPDATE Teacher SET city = 'kathmandu' WHERE TeacherID = 2; ")
conn.commit() 

# Verify update with SELECT
print("\nRecords after update:\n")
cursor.execute("SELECT * FROM Teacher;")
for row in cursor.fetchall():
    print(row)

# e. Drop the Teacher table
cursor.execute("DROP TABLE IF EXISTS Teacher;")

# Commit and close connection
conn.commit()
cursor.close()
conn.close()

Teacher who teaches mathematics:

('Asha Sharma',)

Records after update:

(1, 'Asha Sharma', 'Mathematics', 5, 'Pokhara')
(2, 'Binod Thapa', 'Science', 7, 'kathmandu')